src/cf/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтавкиНДС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Дата") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДатаПроверки = Параметры.Дата;
	ДанныеВыбора = Новый СписокЗначений;
	Исключения = Новый Массив;
	ЗаполнитьИсключения(Исключения, ДатаПроверки);
	
	Для Каждого Ставка Из Перечисления.СтавкиНДС Цикл
		
		Если Исключения.Найти(Ставка) <> Неопределено Или Параметры.СтрокаПоиска <> Неопределено
			И Не СтрПодобнаПоРегулярномуВыражению(НРег(Строка(Ставка)), СтрШаблон("%1.*", НРег(Параметры.СтрокаПоиска))) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеВыбора.Добавить(Ставка);
		
	КонецЦикла;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИсключения(Исключения, Дата = Неопределено)
	
	ДатаОтбор = Неопределено;
	Если Дата = Неопределено Тогда
		ДатаОтбор = ТекущаяДатаСеанса();
	Иначе
		ДатаОтбор = Дата;
	КонецЕсли;
	
	Если ДатаОтбор < ДелопроизводствоКлиентСервер.ДатаНачалаДействияСтавкиНДС18() Тогда
		
		Исключения.Добавить(НДС18);
		Исключения.Добавить(НДС20);
		Исключения.Добавить(НДС22);
		
	ИначеЕсли ДатаОтбор >= ДелопроизводствоКлиентСервер.ДатаНачалаДействияСтавкиНДС18()
		И ДатаОтбор <= ДелопроизводствоКлиентСервер.ДатаПрекращенияДействияСтавкиНДС18() Тогда
		
		Исключения.Добавить(НДС20);
		Исключения.Добавить(НДС22);
		
	ИначеЕсли ДатаОтбор >= ДелопроизводствоКлиентСервер.ДатаНачалаДействияСтавкиНДС20()
		И ДатаОтбор <= ДелопроизводствоКлиентСервер.ДатаПрекращенияДействияСтавкиНДС20() Тогда
		
		Исключения.Добавить(НДС18);
		Исключения.Добавить(НДС22);
		
	Иначе
		
		Исключения.Добавить(НДС18);
		Исключения.Добавить(НДС20);
		
	КонецЕсли;
	
	Если ДатаОтбор < ДелопроизводствоКлиентСервер.ДатаНачалаДействияСтавокНДС5и7() Тогда
		Исключения.Добавить(НДС5);
		Исключения.Добавить(НДС7);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
